ALL_PROVINCE_ACCOMM_DATA = [
    ('Phuket', 'ภูเก็ต', 'https://th.tripadvisor.com/Hotels-g293920-Phuket-Hotels.html'), 
]

ALL_ACCOMM_TYPES = [
    "โรงแรมขนาดเล็ก", "ที่พักพร้อมอาหารเช้า", "โรงแรม", "รีสอร์ท", "ที่พักแบบพิเศษ", "บ้านพัก", "คอนโด", "วิลล่า", "โฮสเทล", "รวมค่าใช้จ่ายทุกอย่างแล้ว",
    "พื้นที่ตั้งแคมป์", "คอทเทจ", "ฟาร์มปศุสัตว์", "โมเตล", "เพนชัน"
]

ALL_ACCOMM_FACILITIES = [
    "คาสิโน", "มาซิโดเนีย", "ลัตเวีย", "เอสโตเนีย", "อาฟรีกานส์", "ไอซ์แลนด์", "โรงเรียนสอนเล่นสกี", "สโลวัก", "สถานที่ยิงธนูนอกที่พัก", "คาตาลัน", "โรมาเนีย", "รวมค่าใช้จ่ายทุกอย่างแล้ว",
    "การเล่นสกี", "สิงหล", "สโลวีเนีย", "ทมิฬ", "ทางเข้า/ออกด้วยสกี", "แร็กเกตบอลนอกที่พัก", "บริการเช่าสกี", "สระว่ายน้ำอุ่น", "ผ้าห่มไฟฟ้า", "อูรดู", "ที่จอดรถสาธารณะภายในสถานที่แบบเสียค่าใช้จ่าย",
    "เซอร์เบีย", "สควอชนอกที่พัก", "สระน้ำในสวนน้ำ", "โบว์ลิ่ง", "เช็ก", "โครเอเชีย", "ฟินแลนด์", "ฮีบรู", "โปแลนด์", "อาบน้ำสไตล์ฮัมมัม", "กรีก", "ฮังการี", "อ่างน้ำพุร้อน", "เนปาล", "ที่จอดรถส่วนตัวภายในที่พักแบบเสียค่าบริการ",
    "แอโรบิกนอกที่พัก", "การยิงธนู", "สควอช", "ยูเครน", "โปรตุเกส", "แบดมินตัน", "อินโดนีเซีย", "นอร์เวย์", "สระว่ายน้ำในร่ม", "แสงบำบัด", "เวียดนาม", "สถานีชาร์จรถยนต์ไฟฟ้า", "สิทธิ์เข้าใช้เลานจ์เอ็กเซกคิวทีฟ",
    "รั้วกั้นรอบสระน้ำ", "อินเทอร์เน็ตแบบเชื่อมต่อผ่านสายฟรีในศูนย์ธุรกิจ", "ที่จอดรถส่วนตัวบริเวณใกล้เคียงแบบเสียค่าใช้จ่าย", "โบว์ลิ่งนอกที่พัก", "เกาหลี", "ที่จอดรถสาธารณะใกล้เคียงแบบเสียค่าใช้จ่าย",
    "เครื่องเล่นวิดีโอเกม", "บริการแต่งหน้า", "รถเข็นเด็ก", "แท่นเชื่อมต่อ iPod", "เครื่องกรองอากาศ", "เตาผิงกลางแจ้ง", "สนามเทนนิสนอกที่พัก", "วิทยุ", "บริการกำจัดขน", "การขัดรองเท้า", "เดนมาร์ก",
    "เฉพาะผู้ใหญ่เท่านั้น", "เครื่องล้างจาน", "ห้องอาบน้ำแบบเปิดโล่ง", "สถานพยาบาล", "ตุรกี", "ภาพยนตร์แบบออนดีมานด์", "คาราโอเกะ", "เก้าอี้นวด", "สวีเดน", "บริการรถรับส่งสนามบินฟรี", "ดัตช์",
    "ห้องสวดมนต์ / ห้องพระ", "อ่างน้ำวน", "มาเลย์", "สวนน้ำ", "มินิกอล์ฟ", "สไลเดอร์น้ำ", "ทัวร์ปั่นจักรยาน", "สระแช่ตัว", "ห้องพักปลอดสารก่อภูมิแพ้", "แอโรบิก", "อาหรับ", "วิวสถานที่สำคัญ",
    "การเล่นวินด์เซิร์ฟ", "ลูกดอก", "การขี่ม้า", "อินเตอร์เน็ตแบบเสียค่าบริการ", "การเดินเขา", "สนามเทนนิส", "Wifi เเบบเสียค่าบริการ", "เตาอบ", "ผู้ฝึกสอนส่วนตัว", "ห้องน้ำรวม", "ห้องโยคะ",
    "การพายเรือแคนูนอกที่พัก", "บริการให้เช่าอุปกรณ์เล่นกีฬาทางน้ำ", "ทัวร์เดินเที่ยว", "สวนน้ำนอกที่พัก", "ญี่ปุ่น", "Wifi ฟรีในศูนย์ธุรกิจ", "เตาผิง", "ระเบียง", "พื้นที่ปิกนิก", "ชายหาดส่วนตัว",
    "บริการพ่อบ้าน", "หนังสือ, ดีวีดี, ดนตรีสำหรับเด็กๆ", "สนามเด็กเล่น", "สเปน", "พนักงานดูแลด้านความบันเทิง", "ฮินดี", "เครื่องถ่ายเอกสาร / แฟกซ์ในศูนย์ธุรกิจ", "ห้องเล่นเกม", "จุดน้ำตื้น"
    "การพันร่างกายกระชับสัดส่วน", "การดูแลเล็บเท้า", "สระว่ายน้ำระบบน้ำเกลือ", "ฟิลิปปินส์", "เทเบิลเทนนิส", "สระผู้ใหญ่", "อุปกรณ์เครื่องเล่นกลางแจ้งสำหรับเด็ก", "การดูแลเล็บมือ", "บอร์ดเกม / เกมปริศนา",
    "การแช่เท้า", "มุ้ง", "ของเล่นในสระว่ายน้ำ", "บริการเรือ", "ห้องเรือนกระจก", "เตาไฟฟ้า", "เครื่องอบผ้า", "สิ่งอำนวยความสะดวกในห้องวีไอพี", "ไนท์คลับ / ดีเจ", "พม่า", "อาคารจอดรถ", "บาร์ชั้นดาดฟ้า",
    "ชั้นเรียนโยคะ", "บุฟเฟ่ต์สำหรับเด็ก", "ความบันเทิงยามค่ำคืน", "ห้องอบไอน้ำ", "บริการรถรับส่งฟรีหรือแท็กซี่", "มีบริการจักรยาน", "การพายเรือแคนู", "ตู้จำหน่ายสินค้าอัตโนมัติ", "เครื่องซักผ้า", "หนังสือพิมพ์",
    "ชั้นเรียนการออกกำลังกาย", "โซฟาเบด", "ห้องน้ำเพิ่มเติม", "โถชำระล้าง", "พื้นที่เด็กเล่นในร่ม", "สนามกอล์ฟ", "เด็กเข้าพักฟรี", "ห้องนั่งเล่นแยกต่างหาก", "บิลเลียด", "บริการจอดรถ", "พนักงานเปิดประตู", "อิตาลี", "พื้นที่รับประทานอาหารต่างหาก", "ห้องสวีทสำหรับคู่แต่งงาน", "บริการที่จอดรถส่วนตัวฟรีบริเวณใกล้เคียง",
    "ความปลอดภัยของโน้ตบุ๊ค", "เตียงยาวเสริม", "ห้องครัวใช้ร่วมกัน", "เครือข่ายโทรทัศน์สำหรับเด็ก", "สระว่ายน้ำแบบไร้ขอบ", "การดำน้ำตื้น", "ห้องล็อกเกอร์ของฟิตเนส / สปา", "สโมสรสำหรับเด็ก", "การตกปลา", "เยอรมัน", "การนวดมือ", "มีเก้าอี้สูงสำหรับเด็ก", "มีห้องที่มีประตูเชื่อมต่อกัน", "บาร์ริมสระว่ายน้ำ", "พื้นที่รับประทานอาหาร", "รัสเซีย", "บริการนวดหน้า",
    "สระว่ายน้ำบนดาดฟ้า", "สระว่ายน้ำส่วนตัว", "บริการนวดคอ", "ห้องสำหรับผู้พิการ", "แฮปปี้อาวร์", "ห้องพักแบบเก็บเสียง", "รายการอาหารพิเศษสำหรับผู้ลดน้ำหนัก", "ดาดฟ้าสำหรับอาบแดด", "สิ่งอำนวยความสะดวกสำหรับผู้พิการ", "บริการนวดสำหรับคู่รัก", "ห้องซาวน่า", "ไวน์ / แชมเปญ", "ห้องจัดเลี้ยง", "มีห้องพักแบบสูบบุหรี่ได้", "ร้านขายของที่ระลึก", "ร้านทำผม", "สิ่งอำนวยความสะดวกในการประชุม",
    "พื้นที่รับประทานอาหารกลางแจ้ง", "อ่างน้ำร้อน", "วิวภูเขา", "พื้นกระเบื้อง / พื้นหินอ่อน", "สระว่ายน้ำบนดาดฟ้า", "มื้ออาหารสำหรับเด็ก", "สระว่ายน้ำสำหรับเด็ก", "เครื่องครัว", "อุปกรณ์ทำบาร์บีคิว", "เช็คอิน / เช็คเอาต์ส่วนตัว", "ชุดอุปกรณ์ปฐมพยาบาล", "ฝรั่งเศส", "การดำน้ำ", "บริการนวดศีรษะ", "สระว่ายน้ำเห็นวิว", "เครื่องดื่มต้อนรับฟรี", "บาร์อาหารว่าง",
    "อาหารเช้าในห้องพัก", "ซักรีดแบบบริการตนเอง", "ห้องอาบน้ำแบบฝักบัว", "การนวดทั่วตัว", "การนวดเท้า", "เห็นวิวสระว่ายน้ำ", "เตารีด", "ที่จอดรถสาธารณะฟรีใกล้เคียง", "ร่ม", "ห้องประชุม", "เฟอร์นิเจอร์กลางแจ้ง", "จีน", "ตู้เสื้อผ้า / ตู้", "กาต้มน้ำไฟฟ้า", "โซฟา", "พื้นที่เลานจ์ / พื้นที่ดูทีวีแบบใช้ร่วมกัน", "ที่จอดรถพร้อมระบบรักษาความปลอดภัย",
    "ไมโครเวฟ", "เก้าอี้อาบแดด / เก้าอี้ชายหาด", "เสื้อคลุมอาบน้ำ", "ร้านค้า", "บริการดูแลเด็ก", "ร้านสะดวกซื้อ", "ชาฟรี", "ที่จอดรถริมถนน", "เคเบิลทีวี / ทีวีดาวเทียม", "ตู้เอทีเอ็มภายในสถานที่", "ร่มกันแดด", "ห้องน้ำส่วนตัว", "บาร์ริมสระว่ายน้ำ", "ทางเข้าสำหรับรถเข็น", "เฉลียงรับแดด", "บริการให้เช่าจักรยาน", "ม่านกันแสง",
    "อาหารเช้าแบบบุฟเฟ่ต์", "การแลกเปลี่ยนเงินตรา", "กาแฟสําเร็จรูปฟรี", "ติดชายหาด", "บริการโทรปลุก / นาฬิกาปลุก", "เช็คอิน / เช็คเอาต์แบบเร่งด่วน", "ผ้าขนหนูสระว่ายน้ำ / ชายหาด", "เครื่องชงกาแฟ / ชา", "ราวแขวนเสื้อผ้า", "ร้านกาแฟ", "ครัวขนาดเล็ก", "โทรศัพท์", "เช็คอิน 24 ชั่วโมง", "พนักงานที่พูดได้หลายภาษา", "ฟิตเนสเซ็นเตอร์", "มีบริการอาหารเช้า", "บริการรีดผ้า",
    "ระเบียงส่วนตัว", "การนวด", "พื้นที่นั่งเล่น", "รักษาความปลอดภัย 24 ชั่วโมง", "ห้องสวีท", "บริการรถรับ-ส่ง", "มินิบาร์", "ทีวีจอแบน", "เครื่องเป่าผม", "บริการซักแห้ง", "บริการแท็กซี่", "โต๊ะทำงาน", "การเช่ารถ", "กิจกรรมสำหรับเด็ก", "ห้องสำหรับครอบครัว", "Wifi สาธารณะ", "บริการเครื่องใช้สำหรับอาบน้ำฟรี",
    "บริการเจ้าหน้าที่อำนวยความสะดวก", "สระว่ายน้ำกลางแจ้ง", "ที่จอดรถ", "แผนกต้อนรับบริการ 24 ชั่วโมง", "น้ำบรรจุขวด", "บริการรูมเซอร์วิส", "บาร์/เลานจ์", "พื้นที่เก็บกระเป๋า", "บริการทำความสะอาด", "อ่างอาบน้ำ / ฝักบัวอาบน้ำ", "โรงแรมปลอดบุหรี่", "ตู้นิรภัย", "ห้องพักปลอดบุหรี่", "บริการรถรับ-ส่งสนามบิน", "อังกฤษ", "ตู้เย็นในห้องพัก", "ไทย",
    "บริการซักรีด", "อินเตอร์เน็ตฟรี", "ทางลงชายหาด", "บริการอินเตอร์เน็ต", "Wifi", "เครื่องปรับอากาศ", "สปา", "นำสัตว์เลี้ยงพักได้", "ศูนย์ธุรกิจ", "ร้านอาหาร", "ที่จอดรถฟรี", "สระว่ายน้ำ", "รวมอาหารเช้า", "Wifi ฟรี"
]