ALL_PROVINCE_ACCOMM_DATA = [
    ('Phuket', 'ภูเก็ต', 'https://th.tripadvisor.com/Hotels-g293920-Phuket-Hotels.html'), 
]

ALL_ACCOMM_TYPES = [
    "โรงแรมขนาดเล็ก", "ที่พักพร้อมอาหารเช้า", "โรงแรม", "รีสอร์ท", "ที่พักแบบพิเศษ", "บ้านพัก", "คอนโด", "วิลล่า", "โฮสเทล", "รวมค่าใช้จ่ายทุกอย่างแล้ว",
    "พื้นที่ตั้งแคมป์", "คอทเทจ", "ฟาร์มปศุสัตว์", "โมเตล", "เพนชัน"
]

ALL_ACCOMM_FACILITIES = [
    "คาสิโน", "มาซิโดเนีย", "ลัตเวีย", "เอสโตเนีย", "อาฟรีกานส์", "ไอซ์แลนด์", "โรงเรียนสอนเล่นสกี", "สโลวัก", "สถานที่ยิงธนูนอกที่พัก", "คาตาลัน", "โรมาเนีย", "รวมค่าใช้จ่ายทุกอย่างแล้ว",
    "การเล่นสกี", "สิงหล", "สโลวีเนีย", "ทมิฬ", "ทางเข้า/ออกด้วยสกี", "แร็กเกตบอลนอกที่พัก", "บริการเช่าสกี", "สระว่ายน้ำอุ่น", "ผ้าห่มไฟฟ้า", "อูรดู", "ที่จอดรถสาธารณะภายในสถานที่แบบเสียค่าใช้จ่าย",
    "เซอร์เบีย", "สควอชนอกที่พัก", "สระน้ำในสวนน้ำ", "โบว์ลิ่ง", "เช็ก", "โครเอเชีย", "ฟินแลนด์", "ฮีบรู", "โปแลนด์", "อาบน้ำสไตล์ฮัมมัม", "กรีก", "ฮังการี", "อ่างน้ำพุร้อน", "เนปาล", "ที่จอดรถส่วนตัวภายในที่พักแบบเสียค่าบริการ",
    "แอโรบิกนอกที่พัก", "การยิงธนู", "สควอช", "ยูเครน", "โปรตุเกส", "แบดมินตัน", "อินโดนีเซีย", "นอร์เวย์", "สระว่ายน้ำในร่ม", "แสงบำบัด", "เวียดนาม", "สถานีชาร์จรถยนต์ไฟฟ้า", "สิทธิ์เข้าใช้เลานจ์เอ็กเซกคิวทีฟ",
    "รั้วกั้นรอบสระน้ำ", "อินเทอร์เน็ตแบบเชื่อมต่อผ่านสายฟรีในศูนย์ธุรกิจ", "ที่จอดรถส่วนตัวบริเวณใกล้เคียงแบบเสียค่าใช้จ่าย", "โบว์ลิ่งนอกที่พัก", "เกาหลี", "ที่จอดรถสาธารณะใกล้เคียงแบบเสียค่าใช้จ่าย",
    "เครื่องเล่นวิดีโอเกม", "บริการแต่งหน้า", "รถเข็นเด็ก", "แท่นเชื่อมต่อ iPod", "เครื่องกรองอากาศ", "เตาผิงกลางแจ้ง", "สนามเทนนิสนอกที่พัก", "วิทยุ", "บริการกำจัดขน", "การขัดรองเท้า", "เดนมาร์ก",
    "เฉพาะผู้ใหญ่เท่านั้น", "เครื่องล้างจาน", "ห้องอาบน้ำแบบเปิดโล่ง", "สถานพยาบาล", "ตุรกี", "ภาพยนตร์แบบออนดีมานด์", "คาราโอเกะ", "เก้าอี้นวด", "สวีเดน", "บริการรถรับส่งสนามบินฟรี", "ดัตช์",
    "ห้องสวดมนต์ / ห้องพระ", "อ่างน้ำวน", "มาเลย์", "สวนน้ำ", "มินิกอล์ฟ", "สไลเดอร์น้ำ", "ทัวร์ปั่นจักรยาน", "สระแช่ตัว", "ห้องพักปลอดสารก่อภูมิแพ้", "แอโรบิก", "อาหรับ", "วิวสถานที่สำคัญ",
    "การเล่นวินด์เซิร์ฟ", "ลูกดอก", "การขี่ม้า", "อินเตอร์เน็ตแบบเสียค่าบริการ", "การเดินเขา", "สนามเทนนิส", "Wifi เเบบเสียค่าบริการ", "เตาอบ", "ผู้ฝึกสอนส่วนตัว", "ห้องน้ำรวม", "ห้องโยคะ",
    "การพายเรือแคนูนอกที่พัก", "บริการให้เช่าอุปกรณ์เล่นกีฬาทางน้ำ", "ทัวร์เดินเที่ยว", ""
]