ALL_PROVINCE_TH = [
       'นครราชสีมา', 'อุบลราชธานี', 'พระนครศรีอยุธยา', 'ศรีสะเกษ', 'เชียงใหม่',
       'ขอนแก่น', 'ร้อยเอ็ด', 'บุรีรัมย์', 'นครศรีธรรมราช', 'กรุงเทพมหานคร',
       'สุรินทร์', 'อุดรธานี', 'กาฬสินธุ์', 'มหาสารคาม', 'สุราษฎร์ธานี',
       'นครสวรรค์', 'สงขลา', 'สกลนคร', 'ชัยภูมิ', 'เชียงราย', 'ลพบุรี',
       'เพชรบูรณ์', 'ปัตตานี', 'สระบุรี', 'สุพรรณบุรี', 'นครปฐม', 'ราชบุรี',
       'ลำปาง', 'น่าน', 'นครพนม', 'กาญจนบุรี', 'พิษณุโลก', 'เพชรบุรี',
       'ฉะเชิงเทรา', 'ชลบุรี', 'เลย', 'พิจิตร', 'ตรัง', 'สุโขทัย', 'ยโสธร',
       'แพร่', 'กำแพงเพชร', 'นราธิวาส', 'จันทบุรี', 'อ่างทอง', 'ชุมพร',
       'อุทัยธานี', 'พะเยา', 'อุตรดิตถ์', 'พัทลุง', 'ปราจีนบุรี', 'ตาก',
       'หนองคาย', 'ปทุมธานี', 'หนองบัวลำภู', 'สระแก้ว', 'ยะลา', 'ระยอง',
       'อำนาจเจริญ', 'ชัยนาท', 'กระบี่', 'บึงกาฬ', 'มุกดาหาร', 'นนทบุรี',
       'ลำพูน', 'สมุทรปราการ', 'พังงา', 'ประจวบคีรีขันธ์', 'แม่ฮ่องสอน',
       'สิงห์บุรี', 'นครนายก', 'สมุทรสาคร', 'ตราด', 'สมุทรสงคราม', 'สตูล',
       'ระนอง', 'ภูเก็ต'
    ]

print(len(ALL_PROVINCE_TH))